app/controllers/account_activations_controller.rb

  def edit
    user = User.find_by(email: params[:email])
    if user && !user.activated? && user.authenticated?(:activation, params[:id])
      user.update_attribute(:activated,    true)
      user.update_attribute(:activated_at, Time.zone.now)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "miky@mail.com"], ["LIMIT", 1]]
UPDATE "users" SET "activated" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["activated", 1], ["updated_at", "2020-01-16 10:38:55.590249"], ["id", 101]]
UPDATE "users" SET "updated_at" = ?, "activated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2020-01-16 10:38:55.618006"], ["activated_at", "2020-01-16 10:38:55.617624"], ["id", 101]]