app/controllers/static_pages_controller.rb

  def home
    if logged_in?
      @micropost  = current_user.microposts.build
      @feed_items = current_user.microposts.where("user_id = ?", current_user.id).paginate(page: params[:page])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND (user_id = 1) ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ? AND (user_id = 1)  [["user_id", 1]]