app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Mich Gold"], ["email", "mich@gold.com"], ["updated_at", "2019-12-23 05:35:14.760934"], ["id", 350169046]]
---
  def update
    # @user = User.find(params[:id]) # Removed because the current_user filter
    # defined the @user variable
    if @user.update(user_params)