app/controllers/users_controller.rb

  def index
    @users = User.where(activated: true).paginate(page: params[:page], per_page: 10)
---
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", 1]]